{
    "_name_or_path": "resnet18_anime_real",
    "architectures": [
        "ResNetForImageClassification"
    ],
    "model_type": "resnet",
    "num_classes": 2,
    "hidden_size": 512,
    "id2label": {
        "0": "anime",
        "1": "real"
    },
    "label2id": {
        "anime": 0,
        "real": 1
    },
    "image_size": 224,
    "pretrained": false,
    "custom_layer": {
        "fc": {
            "in_features": 512,
            "out_features": 2
        }
    }
}
